app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("email", "f_name", "l_name", "session_token", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"